FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "adc.h"
#include "can.h"
#include "dma.h"
#include "tim.h"
#include "usart.h"
#include "gpio.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* -------------------- CONFIGURATION DEFINES -------------------- */
#define __APPS_MIN_BITS 1710U
#define __APPS_MAX_BITS 2690U
#define __APPS_TOLERANCE 50U  // tolerancia para o erro
#define __APPS_DELTA 339U     // usado para normalizar o valor do APPS

#define APPS_MA_WINDOW_SIZE 5  // Window size for moving average

#define CALIBRATE_APPS 0

/*----CAN SAFETY TIMEOUTS----*/
#define MAX_APPS_TIMEOUT_MS 50 //TIMEOUT for APPS loss of communication
//UNCOMMENT IF YOU WANT COMMUNICATIONS CHECKS ON R2D
//#define MAX_R2D_IGN_TIMEOUT_MS 50 //TIMEOUT for IGN and R2D loss of communication
/*---------------------------*/

#define DIGI_BSPD_ENABLE 1    // Enable digital BSPD
#define PAU_CONTROL_ENABLE 0  // Enable power adjust utility (PAU) control

#define print_state 0
#define print_variables 0
#define print_apps 0

#define CAN_DATA_BUS &hcan1
#define CAN_POWERTRAIN_BUS &hcan2
#define CAN_AUTONOMOUS &hcan3

/* BYPASS VARIABLES*/
#define Bypass_brake_pressure 0
#define Bypass_precharge 0

#define BRAKE_PRESSURE_THRESHOLD 20  // Minimum brake pressure (bar) required for R2D

#define SHUTDOWN_DEBOUNCE_TIME_MS 50  // Shutdown signal debounce time in milliseconds
#define IGNITION_DEBOUNCE_TIME_MS 50  // Ignition switch debounce time in milliseconds

#define MAX_RPM_AD 1800  // 44.17 km/h

#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)

/* CAN ID DEFINITIONS */
#define APPS_ADC_RAW_ID 0x710
#define R2D_AND_IGN_ID 0x740


#pragma region Includes
/* -------------------- STANDARD INCLUDES -------------------- */
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stm32f767xx.h>
#include <stm32f7xx_hal_can.h>
#include <stm32f7xx_hal_cortex.h>

/* -------------------- PROJECT INCLUDES -------------------- */
#include "../Inc/proportional_integral_controller.h"
#include "APPS.h"
#include "CAN_utils.h"
#include "bspd.h"
#include "pau_control.h"

#pragma endregion Includes
/* -------------------- GLOBAL VARIABLES -------------------- */
#pragma region Global Variables
// ADC buffers
__attribute__((section(".adcarray"))) uint16_t ADC1_VAL[4];
__attribute__((section(".adcarray"))) uint16_t ADC2_APPS[2];  // ADC2_IN5(apps 1) and ADC2_IN6(apps 2)

// APPS moving average variables
uint16_t apps1_buffer[APPS_MA_WINDOW_SIZE];
uint16_t apps2_buffer[APPS_MA_WINDOW_SIZE];
uint8_t apps_buffer_pos = 0;
uint16_t apps1_avg = 0;
uint16_t apps2_avg = 0;

//APPS Loss of comms tick
volatile uint32_t last_apps_can_rx_time = 0; // keeps track of the last time a valid 0x710 message came through
//UNCOMMENT IF YOU WANT COMMUNICATIONS CHECKS ON R2D
//volatile uint32_t last_r2d_ign_can_rx_time = 0; //keeps track of the last time a valid 0x740 message came through

int value = 0;

// CAN variables
CAN_TxHeaderTypeDef TxHeader_CAN1;
uint8_t TxData_CAN1[8];
uint32_t TxMailbox_CAN1;

CAN_TxHeaderTypeDef TxHeader_CAN2;
uint8_t TxData_CAN2[8];
uint32_t TxMailbox_CAN2;

CAN_TxHeaderTypeDef TxHeader_CAN3;
uint8_t TxData_CAN3[8];
uint32_t TxMailbox_CAN3;

CAN_RxHeaderTypeDef RxHeader;
uint8_t RxData[8];

can_data_t can_data1;  // CAN data structure for CAN1
can_data_t can_data2;  // CAN data structure for CAN2
can_data_t can_data3;  // CAN data structure for CAN3

volatile bool can1_rx_flag = false;
volatile bool can2_rx_flag = false;
volatile bool can3_rx_flag = false;

APPS_Result_t result = {0};  // Result structure for APPS processing

bspd_state_t bspd_state;

uint16_t apps_bspd_pau = 0;

// vars on can utils file
volatile HV500 myHV500;
volatile AS_System_t as_system;
volatile ACU_t acu;
volatile RES_t res;
volatile BMSvars_t bms;
volatile IVT_t ivt;

/* -------------------- STATE MACHINE DEFINITIONS -------------------- */
// VCU state enumeration
typedef enum {
    STATE_INIT,                    // Initial startup state
    STATE_SHUTDOWN,                // Shutdown state
    STATE_STANDBY,                 // Ignition off
    STATE_PRECHARGE,               // Ignition on, precharging
    STATE_WAITING_FOR_R2D_MANUAL,  // Waiting for manual R2D signal
    STATE_WAITING_FOR_R2D_AUTO,    // Waiting for autonomous R2D signal
    STATE_READY_MANUAL,            // Ready to drive in manual mode
    STATE_READY_AUTONOMOUS,        // Ready to drive in autonomous mode
    STATE_AS_EMERGENCY             // Emergency condition detected
} VCU_STATE_t;

// State machine variables
VCU_STATE_t current_state = STATE_INIT;   // Current state of the VCU
VCU_STATE_t previous_state = STATE_INIT;  // Previous state of the VCU

// State names for debug output
const char *state_names[] = {
    "STATE_INIT",
    "STATE_SHUTDOWN",
    "STATE_STANDBY",
    "STATE_PRECHARGE",
    "STATE_WAITING_FOR_R2D_MANUAL",
    "STATE_WAITING_FOR_R2D_AUTO",
    "STATE_READY_MANUAL",
    "STATE_READY_AUTONOMOUS",
    "STATE_AS_EMERGENCY"};

// VCU signals structure
typedef struct {
    bool r2d_button_signal;  // R2D signal
    bool r2d_toggle_signal;  // R2D toggle signal
    bool r2d_button_prev;    // Previous state of button for edge detection

    bool r2d_autonomous_signal;  // R2D signal from autonomous system

    bool shutdown_signal;  // Shutdown signal

    uint8_t brake_pressure;  // Brake pressure signal

    bool ignition_ad;             // ignition comming from autonomous system
    bool ignition_switch_signal;  // Ignition signal

    bool precharge_signal;  // Precharge signal
    bool manual;            // Manual mode signal
    bool autonomous;        // Autonomous mode signal

