FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
    bool AS_emergency;

    // R2D sound control variables
    bool r2d_sound_playing;         // Flag indicating if R2D sound is currently playing
    bool r2d_sound_completed;       // Flag indicating if R2D sound has been played for current R2D event
    uint32_t r2d_sound_start_time;  // Timestamp when R2D sound started

    // Emergency sound control variables
    bool emergency_sound_playing;          // Flag indicating if emergency sound is currently playing
    bool emergency_sound_completed;        // Flag indicating if emergency sound has been played for current emergency event
    uint32_t emergency_sound_start_time;   // Timestamp when emergency sound started
    uint32_t emergency_sound_last_toggle;  // Last toggle time for intermittent sound
    bool emergency_sound_state;            // Current state of the emergency sound (ON/OFF)
} VCU_Signals_t;

long erpm_temporary = 0;  // Temporary variable for ERPM calculations

// Initialize all signals to 0
VCU_Signals_t vcu = {
    .precharge_signal = false,

    .r2d_button_signal = false,
    .r2d_toggle_signal = false,
    .r2d_button_prev = false,
    // All other fields will be initialized to 0/false by default
};

#pragma endregion Global Variables

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
/* USER CODE BEGIN PFP */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc) {
    // Process the data
}

// Timed task function declarations
void execute_10ms_tasks(void);
void execute_100ms_tasks(void);
void execute_immediate_tasks(void);

// Button debounce function declaration
//void debounce_r2d_button(void);
void debounce_shutdown_signal(void);
//void debounce_ignition_switch(void);
#pragma endregion Function Prototypes
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

void CAN1_Filter_Config(void) {
    CAN_FilterTypeDef canfilterconfig;

    canfilterconfig.FilterActivation = CAN_FILTER_ENABLE;
    canfilterconfig.FilterBank = 0;
    canfilterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;
    canfilterconfig.FilterIdHigh = 0x0000;  // Accept all IDs
    canfilterconfig.FilterIdLow = 0x0000;
    canfilterconfig.FilterMaskIdHigh = 0x0000;
    canfilterconfig.FilterMaskIdLow = 0x0000;
    canfilterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    canfilterconfig.FilterScale = CAN_FILTERSCALE_32BIT;

    if (HAL_CAN_ConfigFilter(&hcan1, &canfilterconfig) != HAL_OK) {
        Error_Handler();
    }
}

void CAN2_Filter_Config(void) {
    CAN_FilterTypeDef canfilterconfig;

    canfilterconfig.FilterActivation = CAN_FILTER_ENABLE;
    canfilterconfig.FilterBank = 14;
    canfilterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;
    canfilterconfig.FilterIdHigh = 0x0000;  // Accept all IDs
    canfilterconfig.FilterIdLow = 0x0000;
    canfilterconfig.FilterMaskIdHigh = 0x0000;
    canfilterconfig.FilterMaskIdLow = 0x0000;
    canfilterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    canfilterconfig.FilterScale = CAN_FILTERSCALE_32BIT;

    if (HAL_CAN_ConfigFilter(&hcan2, &canfilterconfig) != HAL_OK) {
        Error_Handler();
    }
}

void CAN3_Filter_Config(void) {
    CAN_FilterTypeDef canfilterconfig;

    canfilterconfig.FilterActivation = CAN_FILTER_ENABLE;
    canfilterconfig.FilterBank = 0;
    canfilterconfig.FilterFIFOAssignment = CAN_RX_FIFO0;

    canfilterconfig.FilterIdHigh = 0x0000;  // Accept all IDs
    canfilterconfig.FilterIdLow = 0x0000;
    canfilterconfig.FilterMaskIdHigh = 0x0000;
    canfilterconfig.FilterMaskIdLow = 0x0000;

    canfilterconfig.FilterMode = CAN_FILTERMODE_IDMASK;
    canfilterconfig.FilterScale = CAN_FILTERSCALE_32BIT;

    if (HAL_CAN_ConfigFilter(&hcan3, &canfilterconfig) != HAL_OK) {
        Error_Handler();
    }
}

/* -------------------- SENSOR FUNCTIONS -------------------- */
/**
 * @brief Measure the brake pressure from an ADC reading
 * @param bits Raw ADC value (12-bit resolution, 0-4095)
 * @return Calculated brake pressure in bar
 * @details Converts ADC reading to voltage, then to pressure using calibration formula.
 *          Sensor characteristics: 28.57mV/bar with 0.5V offset (0 bar = 0.5V)
 */

//Criar função para receber o uint16_t reconstruí-lo (Ja tens uma dessas) e mandar para esta função)

float MeasureBrakePressure(uint16_t bits) {
    // Constants for clarity
    const float ADC_MAX = 4095.0f;
    const float MCU_VREF = 3.3f;             // MCU reference voltage
    const float SENSOR_VREF = 5.0f;          // Sensor reference voltage
    const float CONVERSION_FACTOR = 0.667f;  // Factor to convert 3.3V to 5V scale
    const float OFFSET_VOLTAGE = 0.5f;       // 0 bar = 0.5V
    const float SENSITIVITY = 0.02857f;      // 28.57mV/bar

    // Calculate voltage from ADC reading (0-3.3V range)
    float volts = (float)bits * MCU_VREF / ADC_MAX;

    // Scale to sensor voltage range (0-5V)
    volts = volts / CONVERSION_FACTOR;

    // Apply boundary checking for voltage
    if (volts < 0.0f) {
        volts = 0.0f;
    } else if (volts > SENSOR_VREF) {
        volts = SENSOR_VREF;
    }

    // Calculate pressure from voltage using calibration formula:
    // P(bar) = (V - 0.5V) / 0.02857V/bar
    float pressure = 0.0f;
    if (volts <= OFFSET_VOLTAGE) {
        pressure = 0.0f;  // Anything below offset voltage is 0 bar
    } else {
        pressure = (volts - OFFSET_VOLTAGE) / SENSITIVITY;
    }

    // Limit maximum pressure if needed
    const float MAX_PRESSURE = 250.0f;  // Maximum measurable pressure
    if (pressure > MAX_PRESSURE) {
        pressure = MAX_PRESSURE;
    }

    return pressure;  // Return the brake pressure in bar
}

/**
 * @brief Controls the brake light based on brake pressure and regenerative braking
 * @param brake_pressure Current brake pressure in bar
 * @details Turns the brake light on when pressure exceeds minimum threshold
 *          or when regenerative braking is active (negative current from HV500)
 */
void turn_on_brake_light(uint8_t brake_pressure) {
    // Define thresholds for brake light activation (can be adjusted as needed)
    const uint8_t BRAKE_LIGHT_THRESHOLD = 5;     // bar
    const int16_t REGEN_CURRENT_THRESHOLD = -2;  // Negative current threshold for regen braking (A)

    // Check if brake pressure exceeds threshold OR regenerative braking is active
    bool physical_braking = (brake_pressure >= BRAKE_LIGHT_THRESHOLD);
    bool regen_braking = (myHV500.Actual_DCCurrent < REGEN_CURRENT_THRESHOLD);

