FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
                __HAL_TIM_SET_COMPARE(&htim4, TIM_CHANNEL_1, 1000);
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_SET);
                StartR2DSound();

                break;

            case STATE_AS_EMERGENCY:
                can_bus_send_bms_precharge_state(0, &hcan2);

                break;
        }
    }
}
#pragma endregion UPDATE STATE

#pragma region HANDLE STATE
/**
 * @brief Handle actions specific to the current state
 */
void HandleState(void) {
    // Update R2D sound status if it's playing
    UpdateR2DSound();

    switch (current_state) {
        case STATE_INIT:
            // Initialization actions
            break;
        case STATE_SHUTDOWN:

            static uint32_t last_can_send_time_shutdown = 0;
            uint32_t current_time_shutdown = HAL_GetTick();
            if (current_time_shutdown - last_can_send_time_shutdown >= 1) {
                can_bus_send_bms_precharge_state(0, &hcan2);
                last_can_send_time_shutdown = current_time_shutdown;
            }

            break;

        case STATE_STANDBY:
            static uint32_t last_can_send_time_standby = 0;
            uint32_t current_time_standby = HAL_GetTick();
            if (current_time_standby - last_can_send_time_standby >= 1) {
                can_bus_send_bms_precharge_state(0, &hcan2);
                last_can_send_time_standby = current_time_standby;
            }

            break;

        case STATE_PRECHARGE:
            // Handle precharge process

            static uint32_t last_can_send_time_precharge = 0;
            uint32_t current_time_precharge = HAL_GetTick();
            if (current_time_precharge - last_can_send_time_precharge >= 10) {
                can_bus_send_bms_precharge_state(1, &hcan2);
                last_can_send_time_precharge = current_time_precharge;
            }

            break;

        case STATE_WAITING_FOR_R2D_MANUAL:
            // fade in and out the R2D LED
            led_fade_nonblocking(GPIOD, LED_R2D_Pin);
            led_fade_pwm(&htim4, TIM_CHANNEL_1);

            static uint32_t last_can_send_time_r2d_manual = 0;
            uint32_t current_time_r2d_manual = HAL_GetTick();
            if (current_time_r2d_manual - last_can_send_time_r2d_manual >= 10) {
                can_bus_send_bms_precharge_state(1, &hcan2);
                last_can_send_time_r2d_manual = current_time_r2d_manual;
            }

            break;

        case STATE_WAITING_FOR_R2D_AUTO:
            // Waiting indicator for autonomous mode
            led_fade_nonblocking(GPIOD, LED_R2D_Pin);
            led_fade_pwm(&htim4, TIM_CHANNEL_1);

            static uint32_t last_can_send_time_r2d_auto = 0;
            uint32_t current_time_r2d_auto = HAL_GetTick();

            if (current_time_r2d_auto - last_can_send_time_r2d_auto >= 10) {
                can_bus_send_bms_precharge_state(1, &hcan2);
                last_can_send_time_r2d_auto = current_time_r2d_auto;
            }
            break;

        case STATE_READY_MANUAL:
            // Process manual driving controls
            // Send pedal position to inverter

            static uint32_t last_can_send_time_manuel = 0;
            uint32_t current_time_manuel = HAL_GetTick();

            if (current_time_manuel - last_can_send_time_manuel >= 5) {
                can_bus_send_HV500_SetDriveEnable(1, &hcan2);
                can_bus_send_HV500_SetRelCurrent(apps_bspd_pau, &hcan2);
                can_bus_send_bms_precharge_state(1, &hcan2);
                last_can_send_time_manuel = current_time_manuel;
            }
            break;

        case STATE_READY_AUTONOMOUS:
            // Forward autonomous commands to inverter
            static uint32_t last_can_send_time_auto = 0;
            uint32_t current_time_auto = HAL_GetTick();

            if (current_time_auto - last_can_send_time_auto >= 10) {
                can_bus_send_HV500_SetDriveEnable(1, &hcan2);
                // finished
                if (as_system.state == 5) {
                    can_bus_send_HV500_SetERPM(0, &hcan2);
                    can_send_vcu_rpm(&hcan3, erpm_temporary);  // feedback to jetson
                    // can_send_vcu_rpm(&hcan3, myHV500.Actual_ERPM);
                    can_bus_send_bms_precharge_state(1, &hcan2);
                    last_can_send_time_auto = current_time_auto;

                    // driving
                } else if (as_system.state == 3) {
                    if (as_system.target_rpm > MAX_RPM_AD) {
                        as_system.target_rpm = MAX_RPM_AD;
                    } else if (as_system.target_rpm < 0) {
                        as_system.target_rpm = 0;
                    }

                    uint32_t erpm = as_system.target_rpm * 10;
                    can_bus_send_HV500_SetERPM(erpm, &hcan2);
                    can_send_vcu_rpm(&hcan3, erpm_temporary);  // feedback to jetson
                    // can_send_vcu_rpm(&hcan3, myHV500.Actual_ERPM);
                    can_bus_send_bms_precharge_state(1, &hcan2);
                    last_can_send_time_auto = current_time_auto;

                    // printf("\n\rRPM: %d\n\r", myHV500.Actual_ERPM / 10);
                    // printf("\n\rTarget RPM: %d\n\r", as_system.target_rpm);
                }
            }
            break;

        case STATE_AS_EMERGENCY:
            // Activate emergency indicators
            // Handle emergency state
            static uint32_t last_can_send_time_emergency = 0;
            uint32_t current_time_emergency = HAL_GetTick();
            if (current_time_emergency - last_can_send_time_emergency >= 1) {
                can_bus_send_bms_precharge_state(0, &hcan2);
                last_can_send_time_emergency = current_time_emergency;
            }
            HandleEmergencyStop();
            break;
    }
}
#pragma endregion HANDLE STATE

