FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
// Time-based debounce for R2D button

//---No longer needed - Comes in via CAN2----//
/*void debounce_r2d_button(void) {
    static uint32_t last_debounce_time = 0;
    static bool last_reading = false;
    static bool stable_state = false;

    bool current_reading = HAL_GPIO_ReadPin(int2_r2d_GPIO_Port, int2_r2d_Pin);

    // If state changed, reset debounce timer
    if (current_reading != last_reading) {
        last_debounce_time = HAL_GetTick();
    }

    // State is considered stable if it's been the same for the debounce delay
    if ((HAL_GetTick() - last_debounce_time) > 50) {  // 50ms debounce time
        // Only process state change when it's stable and different from previous
        if (current_reading != stable_state) {
            stable_state = current_reading;

            // Process rising edge (button press)
            if (stable_state && !vcu.r2d_button_prev) {
                vcu.r2d_toggle_signal = !vcu.r2d_toggle_signal;
            }

            vcu.r2d_button_prev = stable_state;
        }
    }

    // Save the reading for next comparison
    last_reading = current_reading;

    // Update raw signal for any code that needs it
    vcu.r2d_button_signal = stable_state;
}*/

// Time-based debounce for shutdown signal
void debounce_shutdown_signal(void) {
    static uint32_t last_debounce_time = 0;
    static bool last_reading = false;
    static bool stable_state = false;

    bool current_reading = HAL_GPIO_ReadPin(int3_shutdown_signal_GPIO_Port, int3_shutdown_signal_Pin);

    // If state changed, reset debounce timer
    if (current_reading != last_reading) {
        last_debounce_time = HAL_GetTick();
    }

    // State is considered stable if it's been the same for the debounce delay
    if ((HAL_GetTick() - last_debounce_time) > SHUTDOWN_DEBOUNCE_TIME_MS) {
        // Update stable state only if it has been stable for the debounce time
        if (current_reading != stable_state) {
            stable_state = current_reading;
        }
    }

    // Save the reading for next comparison
    last_reading = current_reading;

    // Update VCU signal with debounced value
    vcu.shutdown_signal = stable_state;
}

// Time-based debounce for ignition switch
//IGNITION DEBOUNCE LOGIC
/*void debounce_ignition_switch(void) {
    static uint32_t last_debounce_time = 0;
    static bool last_reading = false;
    static bool stable_state = false;

    bool current_reading = HAL_GPIO_ReadPin(int1_ign_GPIO_Port, int1_ign_Pin);

    // If state changed, reset debounce timer
    if (current_reading != last_reading) {
        last_debounce_time = HAL_GetTick();
    }

    // State is considered stable if it's been the same for the debounce delay
    if ((HAL_GetTick() - last_debounce_time) > IGNITION_DEBOUNCE_TIME_MS) {
        // Update stable state only if it has been stable for the debounce time
        if (current_reading != stable_state) {
            stable_state = current_reading;
        }
    }

    // Save the reading for next comparison
    last_reading = current_reading;

    // Update VCU signal with debounced value
    vcu.ignition_switch_signal = stable_state;
}*/

/* -------------------- TIMED TASK FUNCTIONS -------------------- */

/**
 * @brief Execute 10ms tasks (100Hz)
 * @details High-frequency tasks that need precise timing
 */
void execute_10ms_tasks(void) {

	if ((HAL_GetTick() - last_apps_can_rx_time) > MAX_APPS_TIMEOUT_MS) {
	    //at least cut off throttle...
	    ADC2_APPS[0] = 0;
	    ADC2_APPS[1] = 0;
	    // Maybe trigger state emergency??
	    // current_state = STATE_AS_EMERGENCY;
	}

	//MAYBE WE IMPLEMENT, IF THERES TIME (NOTE: CANT KILL IGNITION LIKE THAT!!)
	/*if ((HAL_GetTick() - last_r2d_ign_can_rx_time) > MAX_R2D_IGN_TIMEOUT_MS) {
		    vcu.r2d_button_signal = 0;
		    vcu.ignition_switch_signal = 0;
		}*/

    // Send autonomous HV signal
    can_send_autonomous_HV_signal(&hcan3, bms.precharge_circuit_state, vcu.brake_pressure);

    can_bus_send_vcu_apps_raw(&hcan3, ADC2_APPS[0], ADC2_APPS[1], 0, 0, bspd_state.bspd_active, result.error_type, result.percentage_1000);

    // Send heartbeat frame on CAN2
    uint8_t data[8] = {0};
    CAN_TxHeaderTypeDef TxHeader;
    TxHeader.StdId = 0x69;
    TxHeader.ExtId = 0;
    TxHeader.RTR = CAN_RTR_DATA;
    TxHeader.IDE = CAN_ID_STD;
    TxHeader.DLC = 8;
    TxHeader.TransmitGlobalTime = DISABLE;

    uint32_t TxMailbox;
    HAL_CAN_AddTxMessage(&hcan2, &TxHeader, data, &TxMailbox);

#if CALIBRATE_APPS
    // If calibration is in progress, update it
    if (APPS_IsCalibrating()) {
        bool calibration_complete = APPS_Calibrate(apps1_avg, apps2_avg);
        if (calibration_complete) {
            // Optionally, automatically apply the calibration
            uint16_t min, max, tolerance, delta;
            APPS_GetCalibrationValues(&min, &max, &tolerance, &delta);
            APPS_Init(min, max, tolerance, delta);
        }
    }
#endif

#if print_apps
    APPS_PrintStatus();
#endif
}

/**
 * @brief Execute 100ms tasks (10Hz)
 * @details Medium-frequency tasks for sensor reading and logging
 */
void execute_100ms_tasks(void) {
    // Read brake pressure from ADC
    vcu.brake_pressure = MeasureBrakePressure(ADC1_VAL[0]);
    turn_on_brake_light(vcu.brake_pressure);

    // Debug prints (uncomment if needed)
    // printf("\n\rBrake Pressure: %d\n\r", vcu.brake_pressure);
    // printf("\n\rbits ADC_brake_pressure: %d\n\r", ADC1_VAL[0]);

    can_send_vcu_ign_r2d_signals(&hcan3,
                                 vcu.ignition_switch_signal,                 // manual ignition
                                 (current_state == STATE_READY_MANUAL),      // manual R2D
                                 vcu.ignition_ad,                            // auto ignition
                                 (current_state == STATE_READY_AUTONOMOUS),  // auto R2D
                                 vcu.shutdown_signal,                        // shutdown signal
                                 (uint8_t)current_state);                    // VCU state

