FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
    // Send VCU telemetry frames in rotation (one different frame each time)
    static uint8_t frame_index = 0;

    switch (frame_index) {
        case 0:
            send_vcu_0(&hcan1, &myHV500);
            send_vcu_3(&hcan1, vcu.r2d_toggle_signal, vcu.r2d_autonomous_signal, vcu.ignition_switch_signal,
                       vcu.ignition_ad, &myHV500);

            break;
        case 1:
            send_vcu_1(&hcan1, &myHV500, &bms);
            can_bus_send_brake_pressure(&hcan1, vcu.brake_pressure);
            break;
        case 2:
            send_vcu_2(&hcan1, &myHV500);
            break;
        case 3:
            send_vcu_3(&hcan1, vcu.r2d_toggle_signal, vcu.r2d_autonomous_signal, vcu.ignition_switch_signal,
                       vcu.ignition_ad, &myHV500);
            break;
        case 4:
            send_vcu_4(&hcan1, &acu);
            break;
    }

    // Move to next frame for next execution (cycles through 0-4)
    frame_index = (frame_index + 1) % 5;
} /**
   * @brief Execute immediate tasks (every loop iteration)
   * @details Tasks that need to run as fast as possible
   */
void execute_immediate_tasks(void) {
    // Heartbeat LED indicator
    heartbeat_nonblocking(GPIOB, LED_Heartbeat_Pin);

    // Process CAN3 messages (autonomous bus)
    if (HAL_CAN_GetRxFifoFillLevel(&hcan3, CAN_RX_FIFO0) > 0) {
        CAN_RxHeaderTypeDef RxHeader;
        uint8_t RxData[8];
        if (HAL_CAN_GetRxMessage(&hcan3, CAN_RX_FIFO0, &RxHeader, RxData) == HAL_OK) {
            decode_auto_bus(RxHeader, RxData, &as_system, &acu, &res);
        }
    }

    // Update moving average with new APPS values
    MovingAverage_Update(ADC2_APPS[0], ADC2_APPS[1]);

    // Update state machine
    UpdateState();

    // Execute state-specific actions
    HandleState();
}

/* -------------------- COMMUNICATION FUNCTIONS -------------------- */

/**
 * @brief Redirect printf to UART
 */
PUTCHAR_PROTOTYPE {
    /* Place your implementation of fputc here */
    /* e.g. write a character to the USART1 and Loop until the end of transmission */
    HAL_UART_Transmit(&huart3, (uint8_t *)&ch, 1, 0xFFFF);

    return ch;
}


void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan) {
    // CAN_RxHeaderTypeDef RxHeader1;
    // uint8_t RxData1[8];
    CAN_RxHeaderTypeDef RxHeader2;
    uint8_t RxData2[8];
    // CAN_RxHeaderTypeDef RxHeader3;
    // uint8_t RxData3[8];

    if (HAL_CAN_GetRxMessage(&hcan2, CAN_RX_FIFO0, &RxHeader2, RxData2) == HAL_OK) {
        if (RxHeader2.StdId == 0x14) {

            erpm_temporary = RxData2[0] << 24 | RxData2[1] << 16 | RxData2[2] << 8 | RxData2[3];
            // printf("\n\rERPM: %d\n\r", erpm_temporary);

        }else if (RxHeader2.StdId == APPS_ADC_RAW_ID) { //APPS_ADC_RAW - DBC Powertrain: 122

        	//Fill out the variables previously populated by ADC2
        	__disable_irq(); // Lock interrupts so this update doesnt happen while MovingAverage_Update() is tryring to read it
        	ADC2_APPS[0] = (RxData2[1] << 8) | RxData2[0];
        	ADC2_APPS[1] = (RxData2[3] << 8) | RxData2[2];
        	__enable_irq();  // Unlock interrupts so MovingAverage_Update() can get to reading them

        	last_apps_can_rx_time = HAL_GetTick(); // Reset the safety timer (For checking comms)
        }else if(RxHeader2.StdId == R2D_AND_IGN_ID){//R2D Button and IGN button - DBC Powertrain: 123
        	vcu.ignition_switch_signal = RxData2[0];
			vcu.r2d_button_signal = RxData2[1];
        }else {
        	can_filter_id_bus2(RxHeader2, RxData2, &bms, &myHV500, &ivt);
        }
        //} else {
        //    can_filter_id_bus2(RxHeader2, RxData2);
        //}
        //Isto é BMS e HV500 parece, metemos num else, o default so da break, poupa tempo se a ID nao cair nos casos??
        /*can_filter_id_bus2(RxHeader2, RxData2, &bms, &myHV500, &ivt);*/

    }
}

//----Legacy function for FIFO0 CAN Interrupt----//
/*void HAL_CAN_RxFifo0MsgPendingCallback(CAN_HandleTypeDef *hcan) {
    // CAN_RxHeaderTypeDef RxHeader1;
    // uint8_t RxData1[8];
    CAN_RxHeaderTypeDef RxHeader2;
    uint8_t RxData2[8];
    // CAN_RxHeaderTypeDef RxHeader3;
    // uint8_t RxData3[8];

    if (HAL_CAN_GetRxMessage(&hcan2, CAN_RX_FIFO0, &RxHeader2, RxData2) == HAL_OK) {
        if (RxHeader2.StdId == 0x14) {
            erpm_temporary = RxData2[0] << 24 | RxData2[1] << 16 | RxData2[2] << 8 | RxData2[3];
            // printf("\n\rERPM: %d\n\r", erpm_temporary);
        }
        //} else {
        //    can_filter_id_bus2(RxHeader2, RxData2);
        //}

        can_filter_id_bus2(RxHeader2, RxData2, &bms, &myHV500, &ivt);
    }
}*/

#pragma region MAIN
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
    current_state = STATE_INIT;
  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

    // HAL_ADC_Start_DMA(&hadc3, (uint32_t *)&adc_buffer, 5);

    // HAL_ADC_Start(&hadc3);

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_ADC1_Init();
  MX_CAN3_Init();
  MX_CAN1_Init();
  MX_CAN2_Init();
  MX_TIM1_Init();
  MX_TIM4_Init();
  MX_USART3_UART_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */
    HAL_TIM_Base_Start_IT(&htim2);

    // Configure filters with different banks
    CAN1_Filter_Config();
    CAN2_Filter_Config();
    CAN3_Filter_Config();

    // Enable interrupts for all
    if (HAL_CAN_ActivateNotification(&hcan1, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_CAN_ActivateNotification(&hcan2, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }
    if (HAL_CAN_ActivateNotification(&hcan3, CAN_IT_RX_FIFO0_MSG_PENDING) != HAL_OK) {
        Error_Handler();
    }

